**Analyze this dataset of American college and university undergraduate programs.**

Specifications
1. Discover & visualize the dataset to get insights. Include some key visuals and written
conclusions.
2. Report on relevant statistics.
3. Discuss your steps for cleaning the data.
4. Explain how you identify outliers and what you do with that information.
5. Explain how you approach missing values in the data.


Deliverables and Submission
Compile your results into a single document (pdf, doc, or slideshow), including text and
screenshots.
The document should include:
1. Meaningful insights into the data, presented in a way your audience will understand.
2. A more technical treatment of the data and statistics for your peers.
3. Screenshots and explanations of your process. Make sure to answer all the
questions in the specifications above.
Submit this by sending it as an email attachment.

In [1]:
# Import libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import os

In [8]:
# Read the data from file for inspection

file = pd.ExcelFile('Data/Universities.xlsx')
desc = pd.read_excel(xls, 'Description')
data = pd.read_excel(xls, 'usnews3.data.9 .SS (v5.0)')

In [9]:
desc.head()

              (c) 2016 Galit Shmueli and Peter Bruce
0                                                NaN
1  Source: Compiled from US News and World Report...

In [10]:
data.head()

,College Name,State,Public (1)/ Private (2),# appli. rec'd,# appl. accepted,# new stud. enrolled,% new stud. from top 10%,% new stud. from top 25%,# FT undergrad,# PT undergrad,in-state tuition,out-of-state tuition,room,board,add. fees,estim. book costs,estim. personal $,% fac. w/PHD,stud./fac. ratio,Graduation rate
0,Alaska Pacific University,AK,2,193.0,146.0,55.0,16.0,44.0,249.0,869.0,7560.0,7560.0,1620.0,2500.0,130.0,800.0,1500.0,76.0,11.9,15.0
1,University of Alaska at Fairbanks,AK,1,1852.0,1427.0,928.0,NaN,NaN,3885.0,4519.0,1742.0,5226.0,1800.0,1790.0,155.0,650.0,2304.0,67.0,10.0,NaN
2,University of Alaska Southeast,AK,1,146.0,117.0,89.0,4.0,24.0,492.0,1849.0,1742.0,5226.0,2514.0,2250.0,34.0,500.0,1162.0,39.0,9.5,39.0
3,University of Alaska at Anchorage,AK,1,2065.0,1598.0,1162.0,NaN,NaN,6209.0,10537.0,1742.0,5226.0,2600.0,2520.0,114.0,580.0,1260.0,48.0,13.7,NaN
4,Alabama Agri. & Mech. Univ.,AL,1,2817.0,1920.0,984.0,NaN,NaN,3958.0,305.0,1700.0,3400.0,1108.0,1442.0,155.0,500.0,850.0,53.0,14.3,40.0

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1302 entries, 0 to 1301
Data columns (total 20 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   College Name              1302 non-null   object
 1   State                     1302 non-null   object
 2   Public (1)/ Private (2)   1302 non-null   int64
 3   # appli. rec'd            1292 non-null   float64
 4   # appl. accepted          1291 non-null   float64
 5   # new stud. enrolled      1297 non-null   float64
 6   % new stud. from top 10%  1067 non-null   float64
 7   % new stud. from top 25%  1100 non-null   float64
 8   # FT undergrad            1299 non-null   float64
 9   # PT undergrad            1270 non-null   float64
 10  in-state tuition          1272 non-null   float64
 11  out-of-state tuition      1282 non-null   float64
 12  room                      981 non-null    float64
 13  board                     804 non-null    float64
 14  add. fees                 1028 non-null   float64
 15  estim. book costs         1254 non-null   float64
 16  estim. personal $         1121 non-null   float64
 17  % fac. w/PHD              1270 non-null   float64
 18  stud./fac. ratio          1300 non-null   float64
 19  Graduation rate           1204 non-null   float64
dtypes: float64(17), int64(1), object(2)
memory usage: 203.6+ KB

In [12]:
# Lets rename the columns first for consistancy

data = data.rename(columns={'College Name': 'college_name', 'State': 'state','Public (1)/ Private (2)': 'pub1_pub2',
                            "# appli. rec'd": 'no_of_appl_recd','# appl. accepted': 'no_of_appl_accepted',
                            '# new stud. enrolled': 'no_of_stud_enrolled','% new stud. from top 10%': 'newstud_top10per',
                            '% new stud. from top 25%': 'newstud_top25per','# FT undergrad': 'no_of_ft_undergrad',
                            '# PT undergrad': 'no_of_pt_undergrad','in-state tuition': 'in_state_tuition','out-of-state tuition': 'out_state_tuition',
                            'add. fees': 'additional_fees','estim. book costs': 'estim_book_costs','estim. personal $': 'estim_personal_costs',
                            '% fac. w/PHD': 'faculty_w_phd','stud./fac. ratio': 'stud_fac_ratio','Graduation rate': 'graduation_rate'})

In [13]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1302 entries, 0 to 1301
Data columns (total 20 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   college_name          1302 non-null   object
 1   state                 1302 non-null   object
 2   pub1_pub2             1302 non-null   int64
 3   no_of_appl_recd       1292 non-null   float64
 4   no_of_appl_accepted   1291 non-null   float64
 5   no_of_stud_enrolled   1297 non-null   float64
 6   newstud_top10per      1067 non-null   float64
 7   newstud_top25per      1100 non-null   float64
 8   no_of_ft_undergrad    1299 non-null   float64
 9   no_of_pt_undergrad    1270 non-null   float64
 10  in_state_tuition      1272 non-null   float64
 11  out_state_tuition     1282 non-null   float64
 12  room                  981 non-null    float64
 13  board                 804 non-null    float64
 14  additional_fees       1028 non-null   float64
 15  estim_book_costs      1254 non-null   float64
 16  estim_personal_costs  1121 non-null   float64
 17  faculty_w_phd         1270 non-null   float64
 18  stud_fac_ratio        1300 non-null   float64
 19  graduation_rate       1204 non-null   float64
dtypes: float64(17), int64(1), object(2)
memory usage: 203.6+ KB

## Light EDA

In [15]:
data.isnull().sum() * 100 / len(data)

college_name             0.000000
state                    0.000000
pub1_pub2                0.000000
no_of_appl_recd          0.768049
no_of_appl_accepted      0.844854
no_of_stud_enrolled      0.384025
newstud_top10per        18.049155
newstud_top25per        15.514593
no_of_ft_undergrad       0.230415
no_of_pt_undergrad       2.457757
in_state_tuition         2.304147
out_state_tuition        1.536098
room                    24.654378
board                   38.248848
additional_fees         21.044547
estim_book_costs         3.686636
estim_personal_costs    13.901690
faculty_w_phd            2.457757
stud_fac_ratio           0.153610
graduation_rate          7.526882
dtype: float64

In [16]:
(data.isnull().sum() * 100 / len(data)).sort_values()

college_name             0.000000
state                    0.000000
pub1_pub2                0.000000
stud_fac_ratio           0.153610
no_of_ft_undergrad       0.230415
no_of_stud_enrolled      0.384025
no_of_appl_recd          0.768049
no_of_appl_accepted      0.844854
out_state_tuition        1.536098
in_state_tuition         2.304147
faculty_w_phd            2.457757
no_of_pt_undergrad       2.457757
estim_book_costs         3.686636
graduation_rate          7.526882
estim_personal_costs    13.901690
newstud_top25per        15.514593
newstud_top10per        18.049155
additional_fees         21.044547
room                    24.654378
board                   38.248848
dtype: float64

In [19]:
# Checking if any duplicates are there

data.duplicated().any()

False

## Analysis

In [20]:
# Lets inspect all categorical columns

data.describe(include = 'object')

          college_name state
count             1302  1302
unique            1274    51
top     Bethel College    NY
freq                 4   101

In [23]:
data['college_name'].unique()

array(['Alaska Pacific University', 'University of Alaska at Fairbanks',
       'University of Alaska Southeast', ...,
       'West Virginia Wesleyan College', 'Wheeling Jesuit College',
       'University of Wyoming'], dtype=object)

In [24]:
data['state'].unique()

array(['AK', 'AL', 'AR', 'AZ', 'CA', 'CO', 'CT', 'DC', 'DE', 'FL', 'GA',
       'HI', 'IA', 'ID', 'IL', 'IN', 'KS', 'KY', 'LA', 'MA', 'MD', 'ME',
       'MI', 'MN', 'MO', 'MS', 'MT', 'NC', 'ND', 'NE', 'NH', 'NJ', 'NM',
       'NV', 'NY', 'OH', 'OK', 'OR', 'PA', 'RI', 'SC', 'SD', 'TN', 'TX',
       'UT', 'VA', 'VT', 'WA', 'WI', 'WV', 'WY'], dtype=object)